In [44]:
import pandas as pd

In [45]:
student = {
    "Name": ["Ankit", "Ashwani"," Akshansh", "Gaurav", "Krish"," Sarthak", "Swakshwar"],
    "Section": ["CH", "CH", "MP", "CH", "SS", "MP", "MP"],
    "Registration_Id": [12018329, 12016043, 12015923, 12014917, 12018275, 12018433, 12015939],
}

In [46]:
df = pd.DataFrame(student)

### Default indexes- range of number-integer identifier by default

In [47]:
df["Section"]

0    CH
1    CH
2    MP
3    CH
4    SS
5    MP
6    MP
Name: Section, dtype: object

In [48]:
df.set_index('Section')

              Name  Registration_Id
Section
CH           Ankit         12018329
CH         Ashwani         12016043
MP        Akshansh         12015923
CH          Gaurav         12014917
SS           Krish         12018275
MP         Sarthak         12018433
MP       Swakshwar         12015939

#### Now if we call df again, you will see that our dataframe didn't actually change... (Pandas doesn't do a lot of changes inplace untill we specifically tell it to do so.)

In [49]:
df

        Name Section  Registration_Id
0      Ankit      CH         12018329
1    Ashwani      CH         12016043
2   Akshansh      MP         12015923
3     Gaurav      CH         12014917
4      Krish      SS         12018275
5    Sarthak      MP         12018433
6  Swakshwar      MP         12015939

### If you want to carry your changes in your dataframe, use the following command:-

In [50]:
df.set_index("Registration_Id", inplace=True)

In [51]:
df

                      Name Section
Registration_Id
12018329             Ankit      CH
12016043           Ashwani      CH
12015923          Akshansh      MP
12014917            Gaurav      CH
12018275             Krish      SS
12018433           Sarthak      MP
12015939         Swakshwar      MP

In [52]:
df.index

Int64Index([12018329, 12016043, 12015923, 12014917, 12018275, 12018433,
            12015939],
           dtype='int64', name='Registration_Id')

#### With the help of this, we can use custom labels when using .loc function

In [55]:
df.loc[12018433,"Section"]

'MP'

If we will try to call with the previous default indexes it will throw a Type Error

#### But!, if we want to use those integer indexes later we can use iloc function (IMP)

In [64]:
df.iloc[5,1]
# Only integer parameters

'MP'

In [65]:
# Reset the index
df.reset_index(inplace=True)
df

   Registration_Id       Name Section
0         12018329      Ankit      CH
1         12016043    Ashwani      CH
2         12015923   Akshansh      MP
3         12014917     Gaurav      CH
4         12018275      Krish      SS
5         12018433    Sarthak      MP
6         12015939  Swakshwar      MP

In [ ]:
# Again
df.set_index("Registration_Id",inplace=True)

Sorting the indexes

In [73]:
df.sort_index()

                      Name Section
Registration_Id
12014917            Gaurav      CH
12015923          Akshansh      MP
12015939         Swakshwar      MP
12016043           Ashwani      CH
12018275             Krish      SS
12018329             Ankit      CH
12018433           Sarthak      MP